{"id":2706,"date":"2022-01-09T20:47:04","date_gmt":"2022-01-09T20:47:04","guid":{"rendered":"https:\/\/www.pandimensionals.io\/?p=2706"},"modified":"2022-01-09T20:58:51","modified_gmt":"2022-01-09T20:58:51","slug":"committee-of-dubious-goals","status":"publish","type":"post","link":"https:\/\/www.pandimensionals.io\/committee-of-dubious-goals\/","title":{"rendered":"Committee of Dubious Goals"},"content":{"rendered":"<p>[et_pb_section fb_built=&#8221;1&#8243; _builder_version=&#8221;4.13.1&#8243; _module_preset=&#8221;default&#8221; background_color=&#8221;#000000&#8243; da_disable_devices=&#8221;off|off|off&#8221; global_colors_info=&#8221;{}&#8221; da_is_popup=&#8221;off&#8221; da_exit_intent=&#8221;off&#8221; da_has_close=&#8221;on&#8221; da_alt_close=&#8221;off&#8221; da_dark_close=&#8221;off&#8221; da_not_modal=&#8221;on&#8221; da_is_singular=&#8221;off&#8221; da_with_loader=&#8221;off&#8221; da_has_shadow=&#8221;on&#8221;][et_pb_row column_structure=&#8221;3_4,1_4&#8243; _builder_version=&#8221;4.13.1&#8243; _module_preset=&#8221;default&#8221; width=&#8221;100%&#8221; global_colors_info=&#8221;{}&#8221;][et_pb_column type=&#8221;3_4&#8243; _builder_version=&#8221;4.13.1&#8243; _module_preset=&#8221;default&#8221; global_colors_info=&#8221;{}&#8221;][et_pb_text _builder_version=&#8221;4.13.1&#8243; _module_preset=&#8221;default&#8221; global_colors_info=&#8221;{}&#8221;]<\/p>\n<h6 class=\"p1\"><strong>Kalaxion Invasion Guide EYES ONLY<span class=\"Apple-converted-space\"> <\/span><\/strong><\/h6>\n<p class=\"p1\"><em>Encryption code AZ+3<\/em><\/p>\n<p class=\"p1\"><strong>REF (23\/22) Division 66bd\/Subsection Orientation Basic Primary Clause: Notable figures and Legends<\/strong><\/p>\n<p>*******************************************<\/p>\n<p class=\"p1\">To truly understand <em>The Committee of Dubious Goals<\/em> and their socio-political influence on the community of <a href=\"\/broadcliffs\/\">Broadcliffs<\/a>, we must start at the very beginning. The year is 1954, a small recreation hut on the site of the modest stadium of the <em>Broadcliffs Academicals<\/em>.<\/p>\n<p class=\"p1\"><em>Mr Reginald Culpepper<\/em> (the president of said football team) is once again belittling the hard-working volunteers of this small sporting club. Anybody unfortunate enough to know him well would have happily told you <em>Mr Culpepper<\/em> was a bully and not a very nice person at all. It would have been hard to tell, what with the flushed face, irate voice and general levels of froth spewing from his mouth, but <em>Mr Culpepper<\/em> was thoroughly enjoying himself. He loved nothing better than shouting at people. He had taken it way past the level of a hobby, if you will, one might almost say when it came to shouting and crushing people&#8217;s souls, he was at a competitive professional level.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p class=\"p1\">I will not bore you with the details, but life had not been kind to Reginald from his very beginning. That being said, through a mix of guile, aggression, and lack of empathy, <em>Mr Culpepper<\/em> had managed to drag himself from the gutter to be one of the richest men in Broadcliffs. His harsh background had not instilled within him an understanding of the struggles of his fellow human beings, rather a contempt of their inadequacies. He used his wealth and power like a weapon, one that he was welding with righteous indignation that fateful night.<\/p>\n<p class=\"p1\">At this point, I would like to highlight that the targets of this ire were not in themselves entirely without their own shortcomings.<\/p>\n<p class=\"p1\">Outwardly they might have seemed like upstanding pillars of the community, but each of the twelve that had gathered in that hut were miserable excuses for human beings. Each of them hated too, although in more minor more spiteful ways than <em>Mr Culpepper,<\/em> and they hid their hatred behind a veil of normalcy. I can only recount the histories of the few I had had the unfortunate fate of knowing personally.<\/p>\n<p class=\"p1\">For example, <em>Mr Donald McFoden<\/em>, the local butcher, loathed his customers, and if he wasn&#8217;t ripping them off with his adjusted scales, he was adding unspeakable things to his sausage mix.<\/p>\n<p class=\"p1\">Mr <em>Cecil Crump<\/em>, the park keeper, silently detested children and would often add broken bits of glass into the sandpit, then blame it on the teenagers who frequented the park.<\/p>\n<p class=\"p1\"><em>Mrs Agnes Pugh<\/em>, an accountant&#8217;s secretary, was a scandalous gossip that spread awful rumours to anyone she felt had slighted her in any way. <em>Ms Majorie Simm<\/em>s was a fearsome schoolmistress who only smiled when canning some unfortunate child.<\/p>\n<p class=\"p1\">The rest had their petty hates and small acts of evils to list, trivial examples of jealousies and meanness. I will list their names for the sake of prosperity, <em>Aloysius Brown, Ethal and Stanley Cooper, Madeline Bucket, Morris Weinstacker, Zachary Jones, Louis Chambers, and Dr Joseph Rawlinson.<\/em><\/p>\n<p class=\"p1\">Individually, these twelve had gone through life committing these minor atrocities without significantly impacting society. But that night changed everything. <em>Mrs Agnes Pugh<\/em> was the first to stand up and looked coldly into those bloodshot eyes of <em>Mr Culpepper<\/em>. It acted like a catalyst, one by one, they all rose from their chairs.<\/p>\n<p class=\"p1\">This resulted in <em>Mr Culpepper<\/em> getting even more irate, his face reddening, his voice even louder, but they did not falter.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p class=\"p1\">In the official history of the <em>Committee of Dubious Goals<\/em>, it is stated that the twelve acted instantly together and surged towards this tyrant as a single unit. Whether this telling is apocryphal or not, the result was the same.<\/p>\n<p class=\"p1\">The twelve tore him apart, grabbing and tearing at his clothes and flesh, ripping skin and gouging eyes. The carnage was horrendous, and by the time their bloodlust was sated, bits of Mr Culpepper were strewn across the meeting place.<\/p>\n<p class=\"p1\">There had been no one murderer, it had not been a single blow that had killed him, but their collective efforts had achieved the dastardly goal. And the group realised their collective guilt, and this communal blood was literally on all of their hands.<\/p>\n<p class=\"p1\">Then what can only be described as a miracle happened. This band of sociopaths realised that only by working together they could get away with this heinous crime. They started with a thorough cleaning of the now blood strewn hut. The body pieces were made into a very successful range of pork pies that were sold at a fundraising event. The sudden disappearance of <em>Mr Culpepper<\/em> was explained in a salacious rumour that was widely spread. His vast wealth was redistributed to the <em>Committee<\/em> by the sudden appearance of a new will.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p class=\"p1\">Basking in the success of this perfect murder, the group decided they must carry on. Individually they realised their spiteful efforts amounted to very little, but together they were a genuinely fearsome force of evil.<\/p>\n<p class=\"p1\">Acknowledging their sporting roots and understanding the need to hide their nefarious schemes beneath a veneer of respectably, they called themselves <em>The Committee of Dubious Goals<\/em>. And so was born a truly terrible and powerful organisation, one whose influence permeates every level of this small to medium-sized seaside town of Broadcliffs.<\/p>\n<p class=\"p1\">Although, as I have previously stated, I had the displeasure of being aquatinted with some of the founding members of <em>The Committee of Dubious Goals<\/em>.<\/p>\n<p class=\"p1\">However, I was not at that time aware of their activities or the fact they were pivotal members of a secret organisation bent on world domination. If truth be told, I, like most Broadcliffs residents, was completely unaware that such a group existed.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p class=\"p1\">This was a complete dereliction of duty on my part, and I will report for summary execution when the rest of the <em>Glorious <a href=\"\/kalaxions\/\">Kalaxion<\/a><\/em> Invasion Fleet arrives. It is a stain on my character and a shame I will carry into the next life. The signs that such an organisation might exist were there the whole time. There is even a religious Earth prophecy that states &#8216;the meek shall inherit the Earth&#8217;. It seems the meek got tired of waiting and took matters into their own hands.<\/p>\n<p class=\"p1\">Although once I did become aware of the organisation, I could see them everywhere. They were walking their dogs, sitting behind desks, standing at counters. The average person, the scene filler, so nondescript that their urban camouflage was almost complete.<\/p>\n<p class=\"p1\">But there were certain signs. As individuals, they knew their limits; their hatred of their fellow humans burned within them, but how could they express this? The usual sign was the micro-aggression, tiny, almost senseless acts of pettiness and vindictiveness. Nothing, of course, that could get themselves arrested or even generally noticed by their fellows as an intended brutal attack.<\/p>\n<p class=\"p1\">Examples would be the bank teller that tries to suppress a smile as she tells you your account is overdrawn. The Bus Driver that waits until the last moment before pulling away, leaving you to wait in the rain. And the classic sign of a nest of these social vipers, &#8220;Only two school children at a time&#8221;, posted in the corner shop window.<\/p>\n<p class=\"p1\">By the time I had become aware, even of their very existence, it was already too late… I was surrounded, deep within enemy territory, without even realising it. They were legion in number. The Meek were everywhere.<\/p>\n<p class=\"p1\">Only the expert training I received on Kalaxion kept me sane. The next step was obvious. I had to infiltrate their ranks. I do not wish to assume any false modesty, the suffering I endured on the next stage of my plan cannot be underestimated.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p class=\"p1\">I sat, for hours, in half-empty church halls, drafty school gymnasiums. I attended flower arranging classes and bridge clubs. Literally years of my life past in the scout&#8217;s hut with the arts and craft collective. I endured each one&#8217;s bizarre initiation rites. The blood sacrifices of the &#8216;Bell ringers of St. Lukes&#8217; is a sight that can never be unseen. The &#8216;Lawn bowling association&#8217;s brutal training regimes will always leave me with that recurring nightmare.<\/p>\n<p class=\"p1\">I worked my way up through the ranks of these various organisations, always with the conviction that there must be one central group that rules them all. I went on &#8216;terrifying&#8217; outings, helped out at &#8216;fundraisers&#8217;, I willingly joined the hordes of vile volunteers. And it wasn&#8217;t long before I began to get an understanding of the complex internal organisational structure of this so-called Committee.<\/p>\n<p class=\"p1\"><strong>The Committee comprises six subgroups; <\/strong><\/p>\n<p class=\"p1\"><em>The Steering Committee<\/em> is a shadowy group whose main brief is overall command and control. Little is known of these people, primarily where they recruit their members.<\/p>\n<p class=\"p1\"><em>The Neighbourhood Watch&#8217;s<\/em> remit is security and surveillance and is unique in that its membership comprises of no known subgroups.<\/p>\n<p class=\"p1\"><em>The Sports and Recreations Syndicate<\/em> make up the armed forces, special forces, and shock troops of the Committee.<\/p>\n<p class=\"p1\"><em>The Arts and Crafts Brigade<\/em> cover the strategy and planning operations, a heinous task made worse by the fact it made up of some of the most horrific people you could ever come across.<\/p>\n<p class=\"p1\"><em>Schools, Parks, and Council Workers<\/em> are mainly involved in the research and development needs the Committee might have.<\/p>\n<p class=\"p1\"><em>The Small Business Community Group<\/em> oversee the finance and accounting.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p class=\"p1\">Each subgroup elects two members to the higher Committee every three years, along with the Chairman\/woman.<\/p>\n<p class=\"p1\">The position of Chairman\/woman is one of ultimate power. Due to the fact it is also an incredibly perilous position (usurpations and assassinations attempts are commonplace), the holder welds their power with often brutal force.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p class=\"p1\">It is an open secret that each group loathes every other group and constantly plots the other downfall. In fact, petty rivalries within each subgroup are notoriously common. An example is the turf war of &#8217;97 between <em>The Tuesday Knitting Circle<\/em> and the (now extinct Pavilion Library Thursday Morning Book Club.<\/p>\n<p class=\"p1\">In conclusion,<em> The Committee of Dubious Goals<\/em> is an exceptionally well funded and highly resourced organisation.<\/p>\n<p class=\"p1\">They are legion in number and could challenge Kalaxion ground forces. That being said, they are riven with internal fighting and politicking. The strength of this combined hatred is also their greatest weakness. If they could ever truly unite their forces, join in a single goal or aim, they would be a fearsome foe indeed. And perhaps our invasion might trigger such an event. This is one of the reasons why I have advocated in the past and will continue to press for, the complete annihilation of the human population of Broadcliffs using targeted biogenetic weapons. <span class=\"Apple-converted-space\"> <\/span><\/p>\n<p>[\/et_pb_text][et_pb_post_nav in_same_term=&#8221;on&#8221; prev_text=&#8221;Previous&#8221; next_text=&#8221;Next&#8221; _builder_version=&#8221;4.13.1&#8243; _module_preset=&#8221;default&#8221; title_font_size=&#8221;18px&#8221; custom_margin=&#8221;50px||||false|false&#8221; global_module=&#8221;2210&#8243; global_colors_info=&#8221;{}&#8221;][\/et_pb_post_nav][\/et_pb_column][et_pb_column type=&#8221;1_4&#8243; _builder_version=&#8221;4.13.1&#8243; _module_preset=&#8221;default&#8221; global_colors_info=&#8221;{}&#8221;][et_pb_sidebar area=&#8221;et_pb_widget_area_1&#8243; _builder_version=&#8221;4.13.1&#8243; _module_preset=&#8221;default&#8221; header_font=&#8221;Rubik|||on|||||&#8221; header_text_color=&#8221;gcid-ffd783fe-b482-420a-b0d6-59831d7e35a9&#8243; header_font_size=&#8221;21px&#8221; header_letter_spacing=&#8221;0.5px&#8221; body_text_color=&#8221;gcid-90156a12-9f1f-4767-a26a-19c14ad40e77&#8243; text_orientation=&#8221;left&#8221; background_layout=&#8221;dark&#8221; global_colors_info=&#8221;{%22gcid-ffd783fe-b482-420a-b0d6-59831d7e35a9%22:%91%22header_text_color%22%93,%22gcid-90156a12-9f1f-4767-a26a-19c14ad40e77%22:%91%22body_text_color%22%93}&#8221;][\/et_pb_sidebar][\/et_pb_column][\/et_pb_row][\/et_pb_section]<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Kalaxion Invasion Guide EYES ONLY  Encryption code AZ+3 REF (23\/22) Division 66bd\/Subsection Orientation Basic Primary Clause: Notable figures and Legends ******************************************* To truly understand The Committee of Dubious Goals and their socio-political influence on the community of Broadcliffs, we must start at the very beginning. The year is 1954, a small recreation hut on the [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"on","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[43,40],"tags":[],"_links":{"self":[{"href":"https:\/\/www.pandimensionals.io\/wp-json\/wp\/v2\/posts\/2706"}],"collection":[{"href":"https:\/\/www.pandimensionals.io\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.pandimensionals.io\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.pandimensionals.io\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.pandimensionals.io\/wp-json\/wp\/v2\/comments?post=2706"}],"version-history":[{"count":4,"href":"https:\/\/www.pandimensionals.io\/wp-json\/wp\/v2\/posts\/2706\/revisions"}],"predecessor-version":[{"id":2712,"href":"https:\/\/www.pandimensionals.io\/wp-json\/wp\/v2\/posts\/2706\/revisions\/2712"}],"wp:attachment":[{"href":"https:\/\/www.pandimensionals.io\/wp-json\/wp\/v2\/media?parent=2706"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.pandimensionals.io\/wp-json\/wp\/v2\/categories?post=2706"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.pandimensionals.io\/wp-json\/wp\/v2\/tags?post=2706"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}